import discord

PREFIX: str = "$"
GAME_MODE: list = []
EN_RU_DICTIONARY = {"A": "А", "B": "Б", "C": "К", "D": "Д", "E": "Е", "F": "Ф", "G": "Г",
                    "H": "Х", "I": "И", "J": "Дж", "K": "К", "L": "Л", "M": "М", "N": "Н",
                    "O": "О", "P": "П", "Q": "Ку", "R": "Р", "S": "С", "T": "Т", "U": "У",
                    "V": "В", "W": "Во", "X": "Кс", "Y": "Й", "Z": "З",
                    "a": "а", "b": "б", "c": "к", "d": "д", "e": "е", "f": "ф", "g": "г",
                    "h": "х", "i": "и", "j": "дж", "k": "к", "l": "л", "m": "м", "n": "н",
                    "o": "о", "p": "п", "q": "ку", "r": "р", "s": "с", "t": "т", "u": "у",
                    "v": "в", "w": "во", "x": "кс", "y": "й", "z": "з"
                    }
EN_RU_KEYBOARD_DICT = {
    "A": "Ф", "B": "И", "C": "С", "D": "В", "E": "У", "F": "А", "G": "П",
    "H": "Р", "I": "Ш", "J": "О", "K": "Л", "L": "Д", "M": "Ь", "N": "Т",
    "O": "Щ", "P": "З", "Q": "Й", "R": "К", "S": "Ы", "T": "Е", "U": "Г",
    "V": "М", "W": "Ц", "X": "Ч", "Y": "Н", "Z": "Я", "<": "Б", ">": "Ю",
    "?": ",", "\"": "Э", ":": "Ж", "{": "Х", "}": "Ъ",
    "a": "ф", "b": "и", "c": "с", "d": "в", "e": "у", "f": "а", "g": "п",
    "h": "р", "i": "ш", "j": "о", "k": "л", "l": "д", "m": "ь", "n": "т",
    "o": "щ", "p": "з", "q": "й", "r": "к", "s": "ы", "t": "е", "u": "г",
    "v": "м", "w": "ц", "x": "ч", "y": "н", "z": "я", ",": "б", ".": "ю",
    "/": ".", "'": "э", ";": "ж", "[": "х", "]": "ъ", " ": " ", "&": "?", "^": ":", "$": ";", "#": "№"
}
EN_VOWELS = ("a", "e", "i", "o", "u", "y",
             "A", "E", "I", "O", "U", "Y")
EN_CONSONANTS = ("b", "d", "c", "f", "g", "h", "j", "k", "i", "m", "n", "p", "q", "r", "s", "t", "v", "w", "y", "z",
                 "B", "D", "C", "F", "G", "H", "J", "K", "I", "M", "N", "P", "Q", "R", "S", "T", "V", "W", "Y", "Z")
RUS_LETTERS = ("Й", 'Ц',  'У', 'К', 'Е', 'Н', 'Г', 'Ш', 'Щ', 'З', 'Х', 'Ъ', 'Ф', 'Ы', 'В',
               "А", 'П', 'Р', 'О', 'Л', 'Д', 'Ж', 'Э', 'Я', 'Ч', "С", 'М', 'И', "Т", 'Ь', 'Б', 'Ю',
               "й", 'ц', 'у', 'к', 'е', 'н', 'г', 'ш', 'щ', 'з', 'х', 'ъ', 'ф', 'ы', 'в',
               "а", 'п', 'р', 'о', 'л', 'д', 'ж', 'э', 'я', 'ч', "с", 'м', 'и', "т", 'ь', 'б', 'ю'
               )

SOUND_CHANNEL_ID: int = 1277522924638699582
SOUND_CACHE_PATH: str = "D:/apps/GeniusWoman/cache/sound_cache"
FFMPEG_PATH: str = "D:/apps/GeniusWoman/ffmpeg/bin/ffmpeg.exe"
ROLES: list = [("Игровой режим", discord.Permissions.none(), discord.Colour.red().value)]


